roam/etica_societa_e_privacy.org
:PROPERTIES:
:ID:       29545128-07cf-4918-8988-9ed11bb1e684
:ROAM_ALIASES: ESP
:END:
#+title: Etica, Società e Privacy
#+date: [2023-11-09 Thu 09:41]
#+filetags: university compsci master
* Privacy
** Principi
- Direttiva europea 95
- =GDPR= 2016, entrava in vigore nel 2018 in tutti i paesi UE
  + introduce il concetto di /pseudonimizzazione/
- Privacy by Design and by Default

** Big Data Era
- il concetto è legato con l'idea di possesso, autonomia e integrità delle nostre vite
- le nostre informazioni pubbliche sono utilizzate da terzi per prendere decisioni anche importanti per la nostra vita

#+begin_quote
The right to be left alone
#+end_quote

- dati di credito
- dati telefonici
- dati medici, dati sulle assicurazioni
- dati mail
- social media
- dispositivi =IoT=
- videocamere di sicurezza
- dati =DNA=

/Law of Unintended Consequences/
- =SSN= è era stato pensato per sicurezza sociale
  + ora è utilizzato per identificare gli studenti
- gli smartphone erano nati con scopi di comunicazione
  + ora sono utilizzati come metodi di pagamento
- =DNA= utilizzato per motivi evolutivi
  + potrebbe essere un'identificativo

/Big Data/
- i dati sono molti, cosi tanti che non si sa come gestirli ma neanche come proteggerli
- molti dati sporchi e difficilmente analizzabili
- i dati vengono collezionati in maniera indiscriminata, spesso più di quelli necessari
- dati non ben caratterizzati
- queste quantità di dati permettono l'identificazione di *pattern* che altrimenti non sarebbe possibile riconoscere
  + caso =FDA=, Bing e colesterolo

/Dataification/
- le organizzazioni sono dipendenti dai dati
- business si basano interamente sui dati
- molti business accumulano dati con l'idea di utilizzarli in futuro, contrariamente ai principi del =GDPR=

Questi sviluppo sono possibili solamente, almeno per quanto ne sappiamo attualmente, solo con una perdita del controllo dei singoli verso i propri dati
** Anonymization and Deanonymization
Nel 2006 *Netflix* aveva diffuso un dataset dei suoi utenti e i rating sul sito. I dati erano da utilizzare in una sfida per migliorare l'algoritmo di raccomandazione.
- l'incrocio dei dati con =IMDd= facilmente deanonimizzava il dataset
- non basta la rimozione dell'identificativo per anonimizzare i dati
Nello stesso anno =AOL= rilascia un dataset che viene deanonimizzato dal New York Time
** Data Breach
- studio sul costo dei /data breach/
  + 383 compagnie
  + 12 paesi
  + $4 milioni in media
  + aumento del costo negli anni di più del 29%
  + i dati di più valore sono quelli medici seguita da educazione e finanziari

** Sistemi Informativi
- sistema formale, sociotecnico, organizzazionale
- /collect, protect, store and distribute information used by the organization/
- questi sistemi comprendono si computer ma anche persone
- un *sistema informatico* è composta anche da macchine e persone che cooperano
  + può mettere in atto tutti i compiti citati
  + automatizza il processamento delle informazioni e i processi aziendali

Lo scambio tratta dati di tutti i tipi
- anche privati e personali
- di impiegati/clienti/fornitori

*** Azioni di base
Le misure di privacy in un'azienda vengono messe in atto:
- con l'educazione di manager e impiegati
- rafforzando la cybersecurity
- protezione di rete
- restrizione dell'accesso ad aree sensibili
- l'uso di =VPN= nel lavoro remoto
- aggiornamento software
*** Compliance w/ GDPR
- prendere in considerazione tutti gli intermediari che vengono ad avere accesso ai dati
- /trasparenza/, l'utente deve sapere chi ha accesso ai dati e dove vengono mantenuti
- tutti gli attori rispondono tutti al =GDPR=?
- dopo che l'utente ha ottenuto il risultato ricercato, i dati vengono cancellati?

4 proprietà che vanno implementate in un sistema informativo per rispettare il =GDPR=:
1. attribute-based authorization
2. anonymizing / pseudonymizing data
3. traceability, registro di chi ha creato, modificato o cancellato, quando e perché
4. data deletion

**** Attribute-based Authorization
- *access control*
  + restrizione dell'accesso in un sistema multi utente
  + un sistema complesso necessiterà di una implementazione complessa
- role based access control
  + =RBAC=
  + formalizzato da =NIST= nel 1992
  + indicativamente fino a 500 utenti
  + utilizzare ruoli e non =ID= per gestire il controllo alle risorse
  + limiti:
    - configurazione statica, predefinita
    - non riescono a provvedere un meccanismo flessibile per cui anche utenti/clienti possano esprimere dei requisiti di accesso
    - non modella il motivo per cui è dato l'accesso ai dati
    - non modella il /contesto/ all'accesso delle risorse
      + giusto utente/momento/luogo di accesso ai dati
- attribute based access control
  + =ABAC=
  + aggiunge contesto all'autorizzazione
  + ruolo dell'utente
  + chi e cosa riguarda l'utente
  + a cosa l'utente deve accedere
  + quando l'utente deve accedere
  + come l'utente deve accedere
  + estende i ruoli con contesto e politiche di accesso ai dati
  + può permettere l'accesso in alcuni casi a utenti esterni, cosa impossibile con =RBAC=

=ABAC= utilizza linguaggio naturale per definire le politiche:
#+begin_quote
/Doctors/ can _view_ /medical records/ of /any patient/ in /their department/ and _update_ /any patient record/ that is /directly assigned to them/, during /working hours/ and from /an approved device/.
#+end_quote
Le *policy* si strutturano in
- soggetto
- azione: ~read/write~ o altre più specifiche
- risorsa: metadati, tag, parte di un fascicolo
- ambiente: identifica il contesto, ora, posizione,  protocollo, client, cifratura

Tre aspetti che vengono presi in considerazione:
1. *user*
2. *environment*
3. *information asset*

L'*authorization engine* prende questi e in base alle *policy* rilascia il permesso o meno all'accesso.
Questo engine è composto di
- =PEP=, accesso per le richieste
- =PDP=, decision, valuta le policy che si applicano e ritorna la decisione a =PEP=
- =PAP=, administration, memorizza le policy
- =PIP=, information, memorizza gli attributi

Il linguaggio che implementa =ABAC= è ~XACML~ come linguaggio di interscambio



* Etica
** Metafora
- partendo da [[id:3de0c2e6-55c4-49e8-8932-f04cf95c32a9][Metaphors We Live By]] di [[id:3d6cd7f2-3471-4ca5-b0b8-0fc0af68c6c6][George Lakoff]]
- mapping matematico (o meglio *omomorfismo*) tra concetti complessi della vita e un dominio più semplice da rappresentare
- il nostro cervello utilizza questo meccanismo perché non conosciamo le conseguenze delle nostre azioni, il problema è troppo complesso
  + quindi semplifica

- causalità e tempo sono esempi di domini che non conosciamo bene quanto crediamo e per i quali utilizziamo linguaggio metaforico per farne riferimento
  + si riconducono a qualcosa di più conosciuto
  + anche la tecnologia la concettualizziamo in questo modo

