content/posts/etica_societa_e_privacy.md


### Conoscenza Esplicita e Tacita {#conoscenza-esplicita-e-tacita}

-   teorizzata dal filosofo e economista [Michael Polanyi]({{< relref "20231123031310-michael_polanyi.md" >}})[^fn:1]
-   la conoscenza di cui siamo coscienti non è tutta, il _gap_ è tacito in quanto non esprimibile dal linguaggio e non accessibile alla coscienza
    -   la c. tacita tratta la pratica, che non è trasmissibile o comunicabile
    -   altro esempio sono le regole del linguaggio
    -   altro esempio è la logica, il ragionare è una c. tacita di cui non siamo coscienti di come funzioni
    -   la percezione, utilizziamo linguaggio metaforico per descriverla
    -   la nostra dimensione emotiva[^fn:2]
        -   questa intelligenza non la conosciamo, a volte solamente a posteriori o tramite empatia capiamo i nostri stati emotivi


### Realtà Sociale {#realtà-sociale}

-   da [The Construction of Social Reality]({{< relref "20231123032542-the_construction_of_social_reality.md" >}})
-   non è data ma creata da noi
    -   tutto è deciso da regole **costitutive** ideate dalla collettività
-   la **realtà costruita** costituisce la gran parte della nostra realtà vissuta
    -   la tecnologia sta sempre più cambiando le regole e la realtà in cui viviamo
        -   non cambia fatti naturali ma piuttosto nostre costruzioni sociali


### Conventional Wisdom {#conventional-wisdom}

-   da [The Affluent Society]({{< relref "20231123033317-the_affluent_society.md" >}})
-   competizione tra giusto e accettabile
    -   in  una competizione il vantaggio strategico si trova in ciò che è accettabile, comodo
        -   il test del applauso pubblico influenza più del test della verità
-   teorie scientifiche e modi di fare possiedono una **inerzia** che supera anche il  momento in cui vengono smentite
    -   sono creazioni umane e per questo convenzionali e contengono i bias del nostro ragionamento


### Tecnologia {#tecnologia}

-   la tecnologia inizia con i Neanderthal e continua fino ora
-   la società inizia con la Mesopotamia 3000 anni prima di Cristo
    -   [Yuval Noah Harari]({{< relref "20210604121119-yuval_noah_harari.md" >}}) riconduce il passaggio alla **rivoluzione cognitiva**[^fn:3]
        -   l'uomo ha cominciato a descrivere entità, scenari e miti che non esistono
        -   quindi non la tecnologia ma l'organizzazione della società attraverso e attorno entità fittizie
            -   dei, nazioni, organizzazioni, SPA


### Costruzioni Sociali {#costruzioni-sociali}

Le prime sono state le normative

-   codice di Amurabi
-   codice romano, primo codice moderno
    -   lo schiavo era gestito con una complessa legislazione
        -   gli schiavi svolgevano lavori e stipulavano contratti a loro volta a nome del padrone

I _robot_ sono assimilabili a moderni schiavi, come andrebbero gestiti?

-   potremmo rifarci al codice romano
-   come regolare la responsabilità da parte di un robot
    -   ora una macchina semi-autonoma deve essere _supervisionata_ dall'utente, se non c'è la colpa è dell'umano


### Proprietà {#proprietà}

-   una metafora
-   _commons_ - beni comuni
    -   [The Tragedy of the Commons]({{< relref "20231129072418-the_tragedy_of_the_commons.md" >}})
        -   _claim_: che la proprietà privata è preferibile a quella comune
            -   tutti guardano al proprio _self-interest_ utilizzando il campo comune,
                alla fine non ci sono più risorse per nessuno
            -   la base del Liberismo
    -   [Governing the Commons]({{< relref "20231129072523-governing_the_commons.md" >}})
        -   riscopre l'importanza dei _Commons_, erano regolati per mantenere l'equilibrio
            -   le costruzioni sociali _implicite_ nei commons erano state completamente ignorate da Hardin
        -   Ostrom premio nobel per questo contributo
-   questo deriva dal concetto che le produzioni dell'ingegno siano di proprietà di tutti
-   il concetto nasce da terreni che erano di proprietà della comunità in Inghilterra


### Requerimiento {#requerimiento}

-   i conquistadores prima di conquistare con il massacro le terre indigene dichiaravano un _requerimiento_ con cui intimavano a cedere il terreno agli indigeni, in spagnolo ovviamente
-   una sorta di assoluzione dall'etica tramite sovrastrutture e costrutti sociali


### Linguaggio {#linguaggio}

-   descrive il vero? no
-   può formulare domande, ordini, richieste
    -   tramite formule linguistiche definiamo e cambiamo le regole che regolano il mondo in cui agiamo
-   [How to Do Things with Words]({{< relref "20231129074610-how_to_do_things_with_words.md" >}})


### Liberismo {#liberismo}

-   [Adam Smith]({{< relref "adam_smith.md" >}})
    -   mano invisibile
        -   se ognuno segue il proprio fine egoistico il sistema ne gioisce per tutti
        -   ammissione di razionalità limitata
            -   non abbiamo un modello per cui tanto vale lasciare tutto al mercato
        -   il comunismo ha fallito per mancanza di informazione
            -   la tecnologia in un certo senso potrebbe risolvere il problema, una `AI` può predire e governare un sistema anche senza un modello
                -   una sorta di comunismo in mano a multinazionali private
    -   un artigiano non può parallelizzare il lavoro a differenza di una catena di montaggio
    -   meno conosciuto per le sue posizioni attente alle condizioni lavorative degli operai


### Cartesio {#cartesio}

-   porta una materia complessa nel campo della matematica
-   permette di trattarla con linguaggio formale
-   il corpo era tabù religioso
    -   Cartesio rompe questo tabù logicamente
    -   se lo spazio è studiabile matematicamente, e il corpo è uno spazio, posso studiare il corpo
    -   non posso studiare un corpo morto in movimento ma posso studiarlo tramite simulazione meccanica
        -   questo si applica oggi alla scienza cognitiva, la si può studia con la simulazione tramite intelligenza artificiale[^fn:4]


### La Mettrie {#la-mettrie}

-   [L'Homme Machine]({{< relref "l_homme_machine.md" >}})
-   afferma che il corpo è assimilabile ad una macchina, scomponibile
    -   quindi anche l'anima
-   l'`IA` è proprio un proseguo di questo discorso, la _meccanizzazione_ del pensiero


### Taylorismo {#taylorismo}

-   human micromanagement, controllo e espropriazione delle competenze e conoscenze del proletariato
-   `IA` può allo stesso modo controllare


### Emile Durkheim {#emile-durkheim}

-   [De la Division du Travail Social]({{< relref "de_la_division_du_travail_social.md" >}})

-   a seguito della rivoluzione industriale i lavoratori si sono specializzati
    -   quindi _interdipendenze_ sociali
    -   questo è positivo in quanto la rete sociale ha una dipendenza reciproca tra i lavoratori
    -   questo ha una forza morale
-   questo porta anche grossa disuguaglianza
    -   più difficile la rivendicazione all'interno della società
    -   la politica deve mantenere il diritto al miglioramento della propria situazione
-   queste _interdipendenze_ stanno scomparendo a causa dell'automazione
    -   questo aumento la disuguaglianza di conseguenza


### Primo Emendamento {#primo-emendamento}

15 Dicembre 1791

-   impedisce al governo di legiferare per regolare
    -   religione
    -   diritto di assemblea
    -   libertà di espressione
    -   diritto di petizione al governo

La libertà di parola in quell'epoca poteva effettivamente solo impedirtela il governo.
Ora le corporation possono regolare l'agire del pubblico.
