content/posts/etica_societa_e_privacy.md


### Panopticon {#panopticon}

Geremia Bentham 1791

-   se non sai mai quando sei controllato la tua percezione diventa quella di controllo costante
-   una torre centrale che può controllare in qualsiasi momento ogni luogo dell'edificio
-   nel mondo digitale le corporation aggregano dati di controllo costantemente e possono cederli se richiesto  a terzi
    -   in diritto si devono avere motivi fondati per inquisire su qualcuno, non basta un sospetto infondato
    -   il diritto sta venendo distorto a causa della tecnologia sempre più presente che non è ancora stata limitata a quel livello

Il cambio di prospettiva è:

-   ti comporti bene perché sai che **potresti** essere controllato
-   ti comporti bene perché **sei** controllato


### Attenzione {#attenzione}

[William James]({{< relref "william_james.md" >}}), uno dei padri del Pragmatismo Americano

-   l'esperienza della nostra vita non è altro che ciò cui prestiamo **attenzione**
-   [The Attention Merchants]({{< relref "the_attention_merchants.md" >}})
    -   trasforma l'attenzione, una dimensione profondamente personale, in un **bene di mercato**
-   **pubblicità**, 1833 con il **New York Sun**
    -   Benjamin Day, inventa l'inviato in tribunale
        -   per gli scandali, la qualità si abbassa per vendere a un pubblico più grande
            -   stesso principio delle **Fake News** e dei **Click Bait**
                -   la piattaforme spingono questi contenuti in quanto più tempo passato su di essa significa maggiori introiti
                -   non solo, ora non tutti vedono lo stesso contenuto: lo decide l'algoritmo per ognuno
        -   ha innescato un modello che si evolve con la tecnologia
-   1860 primi poster pubblicitari a Parigi, Jules Cheret
    -   i parigini protestarono questa che vedevano come una svendita degli spazi della loro comunità
    -   mercificazione  dello spazio
-   1890, prima dell'ordine dei medici
    -   i prodotti falsi esistevano da prima ma ora il metodo pubblicitario potenziava  le possibilità di truffa
    -   inizia la pubblicità a domicilio
-   1906 `FDA`
    -   Food and Drugs Act
    -   deve essere


### Monopoli {#monopoli}

-   [The Master Switch]({{< relref "the_master_switch.md" >}})
-   Western Union
    -   compagnia telegrafica
    -   monopolio
    -   le comunicazioni erano lente e in chiaro
        -   `WU` passa le comunicazioni ad Associated Press
        -   scoprono che in alcuni stati se tutti fossero andati a votare c'era la possibilità di ribaltare le elezioni
            -   informazione, comunicazione e politica sono legata fin dall'inizio

[Tim Wu]({{< relref "tim_wu.md" >}}) fa un'analisi storica e evidenzia come in ambito tecnologico e di comunicazione fin dal giorno 0 le compagnie tendono a formare monopoli.

-   telefono inventato in parallelo da più aziende
    -   molte litigation fino al monopolio di **Bell** nel 1888
-   monopolio di Bell nell'est
-   gli indipendenti non possono competere e soccombono al monopolio
-   Antitrust
    -   [The Curse of Bigness]({{< relref "the_curse_of_bigness.md" >}})
-   Rockfeller, Standard Oil, monopoli in petrolio, armi
    -   il monopolio viene sostenuto filosoficamente
    -   [Herbert Spencer]({{< relref "herbert_spencer.md" >}}): con retorica naturalistica viene sostenuto secondo Darwinismo Sociale, il più adatto sopravvive
        -   si cerca di dare giustificazioni naturali a fenomeni sociali costruiti dagli umani
        -   questo squalifica anche la politica dal regolare questi ambiti
        -   stesse teorie utilizzate per giustificare la Shoah

> Any violation of these "natural laws" would only benefit "the survival of the unfittest" and reverse the evolution of the race. [...] The state had neither right or reason to interfere with the workings of the economy.

Lo **Sherman Act** nel 1890 è la reazione da parte della società e della politica nella guerra contro i monopoli.

I monopoli ora sono cambiati, mentre prima i prezzi venivano mantenuti alti

-   argomento utilizzato per combattere i monopoli nella fine dell'ottocento

Ora i monopoli sul web portano tutto a essere _apparentemente_ gratuito.

-   **Theodore Vail**, giustificava i monopoli
    -   sosteneva che la competizione incontrollata fosse a detrimento dell'utente finale
    -   con la sicurezza provveduta dal monopolio sosteneva che le virtù dell'uomo sarebbero emerse
    -   immaginava un futuro economico libero dalla competizione Darwiniana in cui corporazioni organizzate **scientificamente** da uomini buoni e a stretto contatto con lo stato avrebbero servito il bene comune
-   AT&amp;T, standard acquisiti da J.P.Morgan

-   [Karl Polanyi]({{< relref "karl_polanyi.md" >}})
    -   conclude che le operazioni di un mercato che si auto-regola sono profondamente distruttive se lanciate incontrollate da leggi e regolazioni
    -   descrive una **rete di misure e regolamenti** integrate da **forti istituzioni di controllo**
    -   esamina come si arriva al capitalismo
        -   serie di _commodity fictions_
            -   l'idea che la vita umana potesse essere subordinata alle dinamiche di mercato e trasformata in _lavoro_ da vendere
            -   l'idea che la natura potesse essere traslata sul mercato come possedimenti terrieri e _real estate_
                -   [Karl Marx]({{< relref "karl_marx.md" >}}) definiva proprio questo il **big bang** da cui origina l'accumulo moderno di capitale
            -   l'idea che gli scambi diventassero _denaro_

-   [Hannah Arendt]({{< relref "hannah_arendt.md" >}}), [The Origins of Totalitarianism]({{< relref "the_origins_of_totalitarianism.md" >}})
    -   vede che l'accumulo primitivo di Marx non è una esplosione singola ma un evento ciclico
    -   il capitalismo si sostiene grazie a un ciclico accumulo nel mondo naturale
        -   il c. va a _conquistare_ ciclicamente nuove aree naturali e sociali e le trasporta nel mercato assoggettandole alle sue leggi
        -   dove non ci sono regole il c. va a prendere il controllo imponendo le sue
            -   questo fenomeno è chiaro nel colonialismo


#### Ford {#ford}

> Mass production begins in the perception of a public need.

-   5 dollar day
    -   l'operaio producendo l'automobile a un certo punto otterrà il denaro per comprare il bene di consumo prodotto
        -   un circolo virtuoso per il capitalista per così dire

Una **prima modernità** in cui il ruolo di un individuo non è più dove è nato e sempre vissuto ma piuttosto: in che città ti trovi, dove lavori, che cosa possiedi.


#### Cinema {#cinema}

Monopolio di **Edison** sulla costa est.
**Paramount** lotta contro questo colosso a partire da Hollywood.
La antitrust abbatte **Edison**.
Dopo il monopolio rinasce da parte di **Paramount**.


### Propaganda e Parola {#propaganda-e-parola}

-   1914 nasce in Inghilterra la propaganda per la chiamata alle armi
-   1917, comitato dell'informazione pubblica
    -   150000 impiegati
    -   concetto di _volontà di guerra_, la volontà individuale doveva essere sottoposta a quella dello stato per vincere la guerra

_L'industria dell'informazione messa al servizio dello stato._

-   [Public Opinion]({{< relref "public_opinion.md" >}})
    -   _consent is manufactured_
    -   manipolazione dai media controllati dallo stato, anche se limitati dalla democrazia
-   [Triumph of the Will]({{< relref "triumph_of_the_will.md" >}})
    -   la volontà di guerra dello stato, non la volontà individuale


### Marketplace of Ideas {#marketplace-of-ideas}

Concetto nato da **Justice Oliver Wendell Holmes**.

-   metafora economica
-   le idee migliori emergono dallo scambio continuo in un mercato libero delle idee
